audit/mutants/M18-suplike-clip-midpoint.patch
diff --git a/src/PropLang/Lattice.hs b/src/PropLang/Lattice.hs
index 2518a0e..2104b84 100644
--- a/src/PropLang/Lattice.hs
+++ b/src/PropLang/Lattice.hs
@@ -185,7 +185,7 @@ supLike :: Int -> Int -> (Rational, Rational) -> Rational
 supLike n1 n0 (a, b) =
   let m | n1 + n0 == 0 = b
         | otherwise    = fromIntegral n1 % fromIntegral (n1 + n0)
-      p = max a (min b m)
+      p = if m < a || m > b then (a + b) / 2 else m
   in likeQ n1 n0 p
 
 uOf :: (Rational, Rational) -> Rational -> Rational
