audit/mutants/M19-ladder-cap-baked-one.patch
diff --git a/src/PropLang/Purchase.hs b/src/PropLang/Purchase.hs
index 0018686..5ee7f44 100644
--- a/src/PropLang/Purchase.hs
+++ b/src/PropLang/Purchase.hs
@@ -84,7 +84,7 @@ runPurchase w owned0 obsStream = go owned0 (0, 0) obsStream
           (cand, gain) = bestCandidate o c'
           mRefine = case pwRefine w of
             Just s | straddles o c' st ->
-              Just (pwLadderCap w * gain - s - forgone)
+              Just (1 * gain - s - forgone)
             _ -> Nothing
           -- the pinned order: wait head, externals, internal acts
           -- LAST; strict-improvement first-listed fold (CL-3)
