audit/mutants/M2-cond-unnormalized.patch
# MUTANT M2-cond-unnormalized — provenance: Bayes without normalization (CL-4's subject)
diff --git a/src/PropLang/Belief.hs b/src/PropLang/Belief.hs
index 5e9e4a4..c3613a6 100644
--- a/src/PropLang/Belief.hs
+++ b/src/PropLang/Belief.hs
@@ -89,7 +89,7 @@ condK :: Eq b => Belief a -> Kernel a b -> b -> Maybe (Belief a)
 condK (Belief sp@(Space pts) ws) k y =
   let ms = [ w * prob (kernelAt k x) (== y) | (x, w) <- zip pts ws ]
       z = sum ms
-  in if z <= 0 then Nothing else Just (Belief sp [ m / z | m <- ms ])
+  in if z <= 0 then Nothing else Just (Belief sp ms)
 
 -- | Value-matched conditioning: the observed outcome arrives as the
 -- RATIONAL the sentence said (the Cond verb's binder convention);
@@ -100,7 +100,7 @@ condV (Belief sp@(Space pts) ws) k v =
   let ms = [ w * prob (kernelAt k x) (\o -> realToFrac o == v)
            | (x, w) <- zip pts ws ]
       z = sum ms
-  in if z <= 0 then Nothing else Just (Belief sp [ m / z | m <- ms ])
+  in if z <= 0 then Nothing else Just (Belief sp ms)
 
 -- | The marginal MASS of an outcome under belief-through-kernel:
 -- sum_x w(x) * P_k(x)(y). Exact; the bits view is reporting-edge.
