audit/mutants/M20-wait-tie-surrendered.patch
diff --git a/src/PropLang/Purchase.hs b/src/PropLang/Purchase.hs
index 0018686..621bb27 100644
--- a/src/PropLang/Purchase.hs
+++ b/src/PropLang/Purchase.hs
@@ -88,7 +88,7 @@ runPurchase w owned0 obsStream = go owned0 (0, 0) obsStream
             _ -> Nothing
           -- the pinned order: wait head, externals, internal acts
           -- LAST; strict-improvement first-listed fold (CL-3)
-          chosen = foldl pick ("wait", 0)
+          chosen = foldl pick ("wait", -1)
                      (("respond", respondV)
                        : maybe [] (\v -> [("refine", v)]) mRefine)
           pick (bn, bv) (n2, v2) = if v2 > bv then (n2, v2) else (bn, bv)
