audit/mutants/M23-theta-denominator-tripled.patch
diff --git a/src/PropLang/Lattice.hs b/src/PropLang/Lattice.hs
index 2518a0e..2ab10f7 100644
--- a/src/PropLang/Lattice.hs
+++ b/src/PropLang/Lattice.hs
@@ -66,7 +66,7 @@ rootNode = Node 1 0
 -- | The EXACT coordinate (ruling 1): num/2^(depth+1), a sayable
 -- rational — what C-mentions say, what fromWeights weighs.
 nodeTheta :: Node -> Rational
-nodeTheta (Node p k) = p % (2 ^ (k + 1))
+nodeTheta (Node p k) = p % (3 * 2 ^ (k + 1))
 
 -- Elias-gamma length of a positive integer (integer-valued).
 gammaLen :: Integer -> Integer
