audit/mutants/M27-norefine-buys-free.patch
diff --git a/src/PropLang/Purchase.hs b/src/PropLang/Purchase.hs
index 0018686..a682a4f 100644
--- a/src/PropLang/Purchase.hs
+++ b/src/PropLang/Purchase.hs
@@ -85,7 +85,7 @@ runPurchase w owned0 obsStream = go owned0 (0, 0) obsStream
           mRefine = case pwRefine w of
             Just s | straddles o c' st ->
               Just (pwLadderCap w * gain - s - forgone)
-            _ -> Nothing
+            _ -> Just (pwLadderCap w * gain - forgone)
           -- the pinned order: wait head, externals, internal acts
           -- LAST; strict-improvement first-listed fold (CL-3)
           chosen = foldl pick ("wait", 0)
