audit/mutants/M33-straddle-gate-inverted-in-sentence.patch
# MUTANT M33-straddle-gate-inverted-in-sentence — provenance: M22's heir after R7's re-land (the fold died; the gate now lives in-sentence): the If arms swapped fire refine off-straddle
diff --git a/src/PropLang/Purchase.hs b/src/PropLang/Purchase.hs
index d8975db..dca0d44 100644
--- a/src/PropLang/Purchase.hs
+++ b/src/PropLang/Purchase.hs
@@ -128,10 +128,11 @@ runPurchaseS ns feats w owned0 obsStream = go owned0 (0, 0) obsStream
     -- pess > 0 or opt <= 0 => the neutral zero row (never displaces
     -- the wait incumbent); straddle => cap*gain - s - forgone
     refineRow s =
-      If (Gt pessV zeroM) zeroM
+      If (Gt pessV zeroM)
         (If (Gt optV zeroM)
             (Sub (Sub (Mul capM gainV) (mintQ s)) forgoneS)
             zeroM)
+        zeroM
     rows = case pwRefine w of
       Nothing -> (codeM 0, zeroM) :| [(codeM 1, pessV)]
       Just s  -> (codeM 0, zeroM) :| [(codeM 1, pessV), (codeM 2, refineRow s)]
