audit/mutants/M34-refine-formula-drops-forgone.patch
# MUTANT M34-refine-formula-drops-forgone — provenance: the forgone-value
# term of the refine row (the max-0 clamp said in-sentence) dies — the
# clamp's positive arm is never charged. [RE-CUT at the close: the first
# cut deleted the forgoneS MENTION and -Werror rejected the unused
# binding — a mutant must COMPILE; this cut degenerates the definition
# instead, same semantic shape]
diff --git a/src/PropLang/Purchase.hs b/src/PropLang/Purchase.hs
index d8975db..77c9353 100644
--- a/src/PropLang/Purchase.hs
+++ b/src/PropLang/Purchase.hs
@@ -123,7 +123,7 @@ runPurchaseS ns feats w owned0 obsStream = go owned0 (0, 0) obsStream
     pessV = Var Z
     optV = Var (S Z)
     gainV = Var (S (S Z))
-    forgoneS = If (Gt pessV zeroM) pessV zeroM
+    forgoneS = zeroM
     -- the straddle gate and the refine formula, said in-sentence:
     -- pess > 0 or opt <= 0 => the neutral zero row (never displaces
     -- the wait incumbent); straddle => cap*gain - s - forgone
