audit/mutants/M39-ladder-cap-baked-in-sentence.patch
# MUTANT M39-ladder-cap-baked-in-sentence — provenance: M19's HEIR after
# register R7's re-land (the fold died and took M19's target text with it;
# the kLadder lesson's shape re-cut against the sentence route): the
# world-declared ladder cap baked to 1 at the capM mint
# RE-CUT at the f5 close (context drift only: the mint moved to purchaseRows)
diff --git a/src/PropLang/Purchase.hs b/src/PropLang/Purchase.hs
index 362a104..8bc5584 100644
--- a/src/PropLang/Purchase.hs
+++ b/src/PropLang/Purchase.hs
@@ -127,7 +127,7 @@ purchaseRows w = rows
       Nothing -> error "purchaseRows: on-codebook index (unreachable)"
 
     zeroM = mintQ 0
-    capM = mintQ (pwLadderCap w)
+    capM = mintQ 1
     pessV = Var Z
     optV = Var (S Z)
     gainV = Var (S (S Z))
