audit/mutants/M41-forgone-restored.patch
# MUTANT M41-forgone-restored — provenance: the F5 disease resurrected (the
# term deleted at f5-freeze-r0 re-added to the refine arm). KILLED BY f1/f2
# (the price rows) and by NOTHING standing: M34's UNREACHED disposition at
# the trampoline close is the executed proof this mutation is extensionally
# invisible — the unique kill is exactly the kill the corpus cannot make.
diff --git a/src/PropLang/Purchase.hs b/src/PropLang/Purchase.hs
index 362a104..dd83fc5 100644
--- a/src/PropLang/Purchase.hs
+++ b/src/PropLang/Purchase.hs
@@ -131,13 +131,14 @@ purchaseRows w = rows
     pessV = Var Z
     optV = Var (S Z)
     gainV = Var (S (S Z))
+    forgoneS = If (Gt pessV zeroM) pessV zeroM
     -- the straddle gate and the refine formula, said in-sentence:
     -- pess > 0 or opt <= 0 => the neutral zero row (never displaces
     -- the wait incumbent); straddle => cap*gain - s - forgone
     refineRow s =
       If (Gt pessV zeroM) zeroM
         (If (Gt optV zeroM)
-            (Sub (Mul capM gainV) (mintQ s))
+            (Sub (Sub (Mul capM gainV) (mintQ s)) forgoneS)
             zeroM)
     rows = case pwRefine w of
       Nothing -> (codeM 0, zeroM) :| [(codeM 1, pessV)]
