audit/mutants/M86-fold-Lt-inverted.patch
# MUTANT M86-fold-Lt-inverted — provenance: d5 Lt (inversion): the challenger displaces iff strictly WORSE (operands swapped, mints kept).
diff --git a/src/PropLang/Membrane.hs b/src/PropLang/Membrane.hs
index c656887..8182ecb 100644
--- a/src/PropLang/Membrane.hs
+++ b/src/PropLang/Membrane.hs
@@ -321,8 +321,8 @@ policyPick ns feats atomG u cands = case cands of
     step acc chal@(cFeats, bC) = do
       inc@(iFeats, bI) <- acc
       let pick :: Expr '[B Int, B Int] Rational
-          pick = If (Gt (Expect (Var Z) (substW cFeats uB))
-                        (Expect (Var (S Z)) (substW iFeats uB)))
+          pick = If (Gt (Expect (Var (S Z)) (substW iFeats uB))
+                        (Expect (Var Z) (substW cFeats uB)))
                     (reMint atomG 1) (reMint atomG 0)
       env <- mkEnvIn ns (feats ++ [ p | p <- cFeats
                                   , fst p `notElem` map fst feats ])
