audit/mutants/M90-declmass-unpriced.patch
# MUTANT M90-declmass-unpriced [pricing/Kraft / drop-divisor] - provenance: the declared-pair mention mass loses its 1/|S| divisor (declMass=CMass 1): a pair declared among two weighs as much as declared alone. Targets b2b's halving law (mentionMass g = CMass(1/gridSize g), Enumerate.hs at HEAD, binding declMass). Cut against the committed r0a baseline (36ca59f); OB-33 breadth half.
diff --git a/src/PropLang/Enumerate.hs b/src/PropLang/Enumerate.hs
--- a/src/PropLang/Enumerate.hs
+++ b/src/PropLang/Enumerate.hs
@@ -350,7 +350,7 @@ enumerateWithBreadth br kAr ns obsC eg guardGs mrg allowed =
         falseE = Gt zero one
     catB j th = If (eqE (Var Z) (cAt atomG j)) (Mul km1 th) (Sub one th)
     arityMass = CMass (1 / fromIntegral (max 1 (kAr - 1)))
-    declMass = CMass (1 / fromIntegral (max 1 (length (breadthPairs br))))
+    declMass = CMass 1
     unitLatent = mkSpace (thetaPt0 :| [])
     thetaPt0 = case mkC eg 0 :: Maybe (Expr '[] Rational) of
       Just (C _ _ v) -> v
